{
    "contents": [
        {
            "page": "admin-page",
            "content": "Vom Dashboard aus gelangen sie zu allen weiteren Funktionalitäten, die aktuell verfügbar sind."
        },
        {
            "page":"admin-generation",
            "content": "Zur Erstellung eines Admin-Accounts muss Ihre E-Mail zuerst von einem Admin freigegeben worden sein. Ist das der Fall können Sie sich hier als Admin registrieren."
        },
        {
            "page":"admin-exchanges",
            "contents": [
                {
                    "content":"Tauschanfragen durchlaufen drei Stadien. Nach ihrer Erstellung durch den Versender der Anfrage sind sie noch nicht durch den Empfänger bestätigt. Dies wird durch das "
                },
                {
                    "content":"-Symbol deutlich. Hat der Empfänger dem Tausch gestimmt, so zeigt sich das "
                },
                {
                    "content":"-Symbol. Jetzt muss ein Admin den Tausch durchführen. Ist dies geschehen, so verdeutlicht das "
                },
                {
                    "content":"-Häckchen-Symbol, dass der Tausch abgehandelt ist."
                }
            ]
        },
        {
            "page":"admin-exchange-details"
        },
        {
            "page":"admin-logs",
            "content": "Falls Sie weitere Admins in das System intigrieren wollen, müssen Sie vor der Anmeldung die jeweilige E-Mail freigeben. Die entsprechende Person kann sich dann einen Adminaccount erstellen. Dabei ist die Erstellung der Adminaccounts auf den Zeitraum von der Registrierung bis zur Sortierung der Schüler begrenzt."
        },
        {
            "page":"admin-projects",
            "content": "Auf dieser Seite können Sie alle Projekte verwalten. Klicken Sie ein Projekt an, um nähere Informationen zu ihm zu erhalten. Ihnen werden dann auch die Optionen der Löschung und Zulassung des Projektes gegeben. Ein Projekt kann wenn es nicht zugelassen ist weder als Wunsch angegeben, noch von den Schülern angesehen werden. Um Ihnen die Regulierung der eingehenden Projekte zu ermöglichen, muss jedes Projekt standardmäßig erst von einem Admin zugelassen werden bevor es angezeit und auswählbar ist. Sollten Sie das Projekt als nicht zulassungswürdig empfiden, können Sie es löschen. Der zuständige Projektleiter wird dann per E-Mail über die Löschung seines Projektes informiert."
        },
        {
            "page":"admin-schedule",
            "content": "Der Zeitplan legt fest, wann welche Aktionen zur Verfügung stehen. Er kann sehr einfach und zu jedem Zeitpunkt bearbeitet werden. Es wird allerdings strengstens von einem nachträglichen Ändern abgeraten."
        },
        {
            "page":"admin-students-leaders",
            "contents": [
                {
                    "content": "Hier sehen Sie alle Schüler und falls Sie schon zugewiesen sind Ihre Projekte, außerdem sehen Sie die drei Projektwünsche (Wichtigkeit von oben nach unten) und die angegebenen Freunde des jeweiligen Schülers."
                },
                {
                    "content": "Durchsuchen sie alle angemeldeten Schülern nach E-Mail, Vor-, Nachname und Klasse (Zahl und Buchstabe)."
                },
                {
                    "content": "Hier haben Sie eine Übersicht über die verschiedenen Projektleiter, sowie einen Link zum jeweiligen Projekt. Falls ein Projektleiter noch oder nicht mehr Leiter eines Projektes ist, so können Sie ihn von hier aus direkt löschen, achten Sie aber bitte darauf nur bewusst ausgewählte Leute zu löschen."
                },
                {
                    "content": "Hier können Sie zu gegebener Zeit die Sortierung der Schüler abwickeln. Erstellen sie dafür einen Sortiervorschlag, der vom Algorithmus geliefrete Vorschlag zur Sortierung der Schüler wird ihnen dann angezeigt. Alternativ können sie auch, wenn sie schon einen Sortiervorschlag haben diesen laden."
                },
                {
                    "content": "Hier wird ihnen der Sortiervorschlag für die Sortierung der Schüler angezeigt. Er enthält die Projekte und die ihnen zugeordneten Schüler. Sie können die Schüler beliebig in Projekte verschieben. Achten sie aber darauf, dass das Auffangprojekt für nicht zuordnbaren Schüler leer bleibt."
                }
            ]
        },
        {
            "page":"forgot-password",
            "content": "Bitte lassen Sie sich von einem Admin ein Token zuschicken."
        },
        {
            "page":"reset-password",
            "content": "Hier können Sie Ihr Passwort zurücksetzen."
        },
        {
            "page":"leader-generation",
            "content": "Hier können Sie sich als Projektleiter registrieren. Als Projektleiter können Sie ein Projekt erstellen, verwalten und schließlich auch am Gymnasium Dorfen durchführen. Für Fragen wenden Sie sich bitte an den Systemadministrator."
        },
        {
            "page":"leader-page",
            "content": "Auf dieser Seite können Sie Ihr Projekt verwalten bzw. ein neues Projekt erstellen."
        },
        {
            "page":"leader-project-generation",
            "content": "Hier können Sie Ihr Projekt erstellen. Lassen Sie sich dafür aber genug Zeit und füllen Sie die Felder sorgfältig aus. Sie können das Projekt im Nach­hi­n­ein noch bearbeiten."
        },
        {
            "page":"student-generation",
            "content": "Hier kannst du deinen Account erstellen. Dazu benötigst du allerings ein Token, dass du von deinen Lehrkräften bereits bekommen haben solltest."
        },
        {
            "page":"student-page",
            "content": "Auf dieser Seite kannst du deinen Account verwalten. Du kannst ein Projekt erstellen oder dich auch nur für Projekte anmelden. Außerdem kannst nach der Sortierungsphase Tauschanfragen stellen und annehmen."
        },
        {
            "page":"student-exchange-confirm",
            "content": "Hier kannst du eine gestellte Tauschanfrage annehmen. Klicke dazu einfach auf den Knopf neben der Anfrage."
        },
        {
            "page":"student-exchange-request",
            "content": "Hier kannst du eine Tauschanfrage stellen, fülle dazu einfach das Formular aus und klicke auf 'Tauschanfrage senden'"
        },
        {
            "page":"student-projects",
            "content":"Implimentiert"
        },
        {
            "page":"promote-students",
            "content": "Hier kannst du andere Schüler auswählen, die dir bei deinem Projekt helfen sollen. Sie können auch Notizen an das Projekt anhägen. Wähle sie aber sorgfältig aus, denn du kannst sie nach der Anmeldungsphase nicht mehr entfernen."
        },
        {
            "page":"student-registration",
            "content": "Hier kannst du deine Projektwünsche äußern, fülle dazu einfach die folgenden Felder fehlerfrei aus. Falls du mit einem Freund zusammen in ein Projekt willst kannst du ihn hier angeben, beachte aber, dass auch er oder sie dich als Freund angeben muss."
        },
        {
            "page":"student-project-generation",
            "content": "Hier kannst du dein Projekt erstellen. Lasse dir sich dafür aber genug Zeit und fülle die Felder sorgfältig aus. Du kannst das Projekt im Nach­hi­n­ein noch bearbeiten."
        },
        {
            "page":"settings",
            "contents": [
                {
                    "content": "Hier kannst du die Farbe des Hintergrundes bestimmen."
                },
                {
                    "content": "Hier kannst du die Farbe der Knöpfe, Felder, etc. bestimmen."
                }
            ]
        },
        {
            "page":"email-verification",
            "descriptions": [
                {
                    "code": "200",
                    "title": "E-Mail wurde erfolgreich verifiziert.",
                    "descr": "Sie können nun ungehindert auf Ihren Account zugreifen. Es kann allerdings sein, dass Sie ihn vorher nocheinmal neu laden müssen."
                },
                {
                    "code": "400",
                    "title": "E-Mail wurde bereits verifiziert." ,
                    "descr": "Es scheint als hätten Sie Ihre E-Mail bereits verifiziert. Sie können somit schon auf Ihren Account zugreifen. Falls dies nicht der Fall ist laden Sie die Seite neu. Sollte der Fehler immernoch bestehen, kontaktieren Sie einen Systemadministrator."
                }
            ]
        }
    ]
}